{
    "summary": "These appeals by special leave arose from applications made by the respondents, who were employed as timekeepers in the time office of the Central Railway Workshop and Factory, Parel, Bombay, claiming payment of overtime wages under the Payment of Wages Act,  ( of ). Consistently with its policy, the Act, which provides for overtime wages for employees in all establishments, provides for overtime wages for employees in factories as well by making the relevant provisions of the Factories Act applicable to them. Hira, Works Manager, Central Rail- way Workshop and Factory, Pa.rel, Bombay (hereafter called the appellant) by the employees at the said factory (hereafter called the respondents) under the Payment of Wages Act,  (IV of ) claiming payment of overtime wages since . · In the result the claim for overtime wages for the period prior to May , , was rejected on the preliminary ground of delay whereas the claim for the period subsequent to the sa.id da.te wa.s con- sidered on the merits.• The respondent's ca.se wa.s that he was entitled to the overtime wages for work on such Sundays when he was not given a holiday within three da.ys prior to or three da.ys subsequent to the Sundays on which he worked. (m) of the Factories Act defines a factory as meaning any premises including the precincts thereof- \" (i) whereon ten or more workers are working, or were working on any day of the preceding twelve months, and in any part of which a manufacturing process is being carried on with the aid of power, or is ordinarily so carried on, or (ii) whereon twenty or more workers are working, or were working on aiiy day of the preceding twelve months, and in any part of which a manufacturing process is being carried on without the aid of power, or is ordinarily so carried on,- but does not include a mine subject to the opera- tion of the Mines Act,  (XXXV of ), or a railway running shed\" ands.",
    "keywords": [
        "factories",
        "wages",
        "under",
        "overtime",
        "factory",
        "authority",
        "establishments",
        "provisions",
        "workers",
        "section"
    ]
}