{
    "summary": "The jurisdiction of the High Court in the matter of income- tax references is an advisory jurisdiction and under the Incone- tax Act the decision of the Appellate Tribunal on facts is final unless it can be successfully assailed on the ground tha~ there was ,_ S.C.R. SUPREME COURT REPORTS  no evidence for the conclusions on facts recorded by the Tribnnal. , ,  and  of  for the said aggregate sum of Rs. ,, and the interest thereon AND WHEREAS the said Mills have been advised to settle the said suits amicably AND WHEREAS the Calcutta Agency Limited by its Directors, S.N. Mitter or S.C. Mitter, having been and being still the Manag- ing Agents of the said Mills have undertaken to reimburse the said Mills in respect of the decrees to oe made in the said four suits in the manner hereinafter appearing NOW THESE PRESENTS WITNESS AND IT IS HEREBY AGREED AND DECLARED (i) That out of the commission of % payable by the said Mills to the said Agency under Regulation  of the Articles of Association of the Company, the Company shall have paramount lien on and deduct and set off a moiety thereof against any payment which the said Mills may make in respect of the decrees or any of them and/or costs of the said suits. • S.C.R. SUPREME COURT REPORTS  necessary facts in that connection was on the assessee,  it being common ground that the commission was due ---- and had become payable and was therefore the business cc7m\"\" '\" of income of the assessee company liable to be taxed in ,.m. Nowhere in the statement of the case prepared by the Tribunal and filed in the High Court, the Tribunal had come to the conclusion that the payment was made by the assessee company to avoid any danger of public exposure or to save itself from scandal or in order to maintain the managing agency of the appellant company. to proved that the borrowing is for the purpose of the business and the loan was used in the business, the interest cannot be allowed under section ()(iii).\" The second objection raised before the Appellate Assistant Commissioner was in these terms-·' That the Income-tax Officer should have allowed the said sum of Rs. , as allowable expenditure being alloca- tion of a sum out of the revenue receipt before it became income in the hands of the assessee.\" The wording of the objection and the argument noticed in the order of the Appellate Assistant Commissioner show that the contention was that this sum should be treated as not having become the income of the assessee at all because it was deducted at the source by the Mill company.",
    "keywords": [
        "court",
        "company",
        "income",
        "under",
        "facts",
        "tribunal",
        "mills",
        "section",
        "agency",
        "business"
    ]
}