{
    "summary": "WANCHOO, JJ.) Industrial Dispute-Award against company in liquidation- Appeal by managing director and auction-pu.rchaser not aggrieved by the award-Summary dismissal by Appellate Tribunal-Validity- Right of appeal-Industrial Disputes (Appellate Tribunal) Act, z950 ( of z950), s. The liquidators were refused sanction to appeal from the said award by the High Court whereupon the auction-purchaser who was also the managing director of the Company, prior to its liquidation, preferred an appeal in the name of the Company represented by himself as the managing director and also in his capacity as the auction-purchaser of the Company.  SUPREME COURT REPORTS [()] r959 No person other than the Official Liquidator, who is placed in charge of the affairs of the Company in the process of winding Great Indian up, is authorised with the sanction of the Court to institute any Motor Works Ltd., suit, prefer an appeal or other legal proceedings in the name and and Another on behalf of the Company. It may be noted here that the proceedings before the Industrial Tribunal had commenced without the necessary sanction of the High Court in the liquida- tion proceedings, but during the pendency of the proceedings, the High Court, by its order dated Decem- ber , , granted leave to the workmen to proceed with and continue the proceedings against the Official Liquidators of the Company. The Tribunal put this on three main grounds-() that the auction-purchaser had purchased the business of the Company free from all encumbrances, out-goings and liabilities, () that tho employment of the work- men had been terminated hy the Liquidators before possession of the business was delivered to the auction- purchaser, and () that there was no relationship of employer and employees between the auction-purchaser and the workmen whose services were so terminated.",
    "keywords": [
        "appeal",
        "company",
        "tribunal",
        "auction",
        "court",
        "purchaser",
        "employees",
        "industrial",
        "appellate",
        "order"
    ]
}