{
    "summary": "the sugar from one place to another, or to the delay likely to be involved in exporting it,.or to the conditions prevailing in the markets for sugar, whether in or out of India, or to any other relevant circumstance, it is expedient so to do, the export agency may sell the whole or any part of the sugar in India  SUPREME COURT REPOHTS [()] ' >md may, if it thinks fit, purchase such quantity of - sugar as it may co1'.sider necessary for export at the - TheLordf.rishna · t t'' • Sugar ,1till8 Ltd., <.})J.)ro11r1a e .1n1e. \"in fixing such quantity the Central Government shall have regard to -(a) the quantity of sugar available in India, (b) the the quantity of sugar which, in its opinion, would be reasonably required for consumption in India, (c) the necessity for exporting sugar with a view to earning foreign exchange in the public interest.\" Section  requires the Central Government to apportion the quantity fixed under s. Section  provides that every owner of a factory shall, on demand by the export agency deliver to it sugar upto its export quota and on delivery \" the owner shall retain no rights in respect of such sugar except his right to receive payment therefor under section .\" Section  makes provision for an additional excise duty being levied in certain circum- stances on the quantity of sugar by which the sugar delivered by the owner of a factory falls short of its export quota. Section  states that the export agency shall export the sugar delivered to it, provided that in certain circumstances specified, the export agency may sell that sugar in India and may if it thinks fit pur- · chase other sugar for export and for this purpose permit the owner to sell the whole or part of its export .quota at a price approved, on condition t.hat the sale proceeds are paid to it. time the quantity of sugar which may be exported during any period, and, in fixing such quantity, the Central Government should have regard to the quantity of sugar available in India, the quantity of sugar which, in its opinion, would be reasonably required for consumption in India, and the necessity for exporting sugar with a view to earning foreign excliange in the public interest.",
    "keywords": [
        "sugar",
        "export",
        "another",
        "government",
        "under",
        "mills",
        "agency",
        "price",
        "india",
        "court"
    ]
}