{
    "summary": "Mitra of the Special Police Establishment, Calcutta, to make a representation to the Additional District Magistrate,  Parganas (hereinafter referred to as the Addtiona1 District Magistrate) for permission to proceed against the appellant as required under s. It is true that the High Court has taken a different view to that taken by the trying Magistrate and has rejected the appellant's case that he had vol- untarily handed over the currency notes in question to the Customs Officers in the circumstances mentioned by him and that he had no intention to take that money out of India without a permit. The main submission on behalf of the appellant was directed towards establishing that the entire proceed ings before the Additional District Magistrate and the trying Magistrate were without jurisdiction as cogniz- ance of the offence had been taken on September , , in contravention of the provisions of s. The Additional District Magistrate thereon recorded the following order \"Seen the complaint filed to day against the accused Narayandas Bhagwandas Madhavdas under section () of the Foreign Exchange Regulation Act read with Section 23B thereof read with Section  of the Sea Customs Act and Notification No. ]'.E.R.A. / dated the 27th February, , as amended, issued by the Reserve Bank of India under Section () of the Foreign Exchange Regulation Act. It seems to me clear however that before it can be said that any magistrate has taken cognizance of any offence under section (l}(a) Criminal Procedure Code, he must not only have applied his mind to the contents of the petition but muRt have done so for the purpose of proceeding in a particular way as indicated in the subsequent provi- sions of this Chapter-proceeding under section  and thereafter sending it for inquiry and report under section .",
    "keywords": [
        "magistrate",
        "appellant",
        "court",
        "district",
        "additional",
        "offence",
        "september",
        "under",
        "cognizance",
        "taken"
    ]
}