{
    "summary": "his total income and total world income during the prov ions year • • • () If any person has not furnished a return with- in the time allowed l1y or under sub-section (I) or sub-section (), or having furnished a return under either of those sub-sections, discovers any omission or wrong statement thprein, he may furnish a return or a revised return, as the case may be at any time before the assessment is made.\" It will be seen from this, that, as the Bombay High Court correctly pointed out, there is a time limit provided in sub-ss. A return which showed no assessable income, could not possibly be 'treated' as a return filed under section () or a return called for under that section but filed under section (), when in fact it was filed in response to a notice under section ().\" The opinion here expressed was criticised in the judgment under appeal, and in the next case, R.  \" 'It should be remembered', I observed 'that the return in the present case is being sought to be treated as a return under section (), belatedly filed.' And then I went on to say that a return under section () would only be filed by a person who thought that he had a taxable income and therefore a return showing an income below the taxable limit could not be held, on a construction thereof, to be a return under section () and consequently the return in the case we were then considering could not be treated as such a return filed under section (). To say that, was not to say that even a return filed in compliance with a notice under section (), if filed belatedly under section () could not be a return showing an income below the taxable limit.'' This left the matter somewhat ambiguous as to what was really meant, and in Commissioner of Income-f,ax v. J., and Tendolkar, J., held (as stated in the head note) \"Notice under section  is only necessary if at t.he end of the assessment year no return has been made by the assessee, and the authorities wished to proceed under section (), but where the assessee himself chooses voluntarily to make a return, no question can arise under section  of assessment escaping, and therefore there is no necessity to 8erve any notice under section .\" This represents the law applicable to the facts as they are to be found in this case.",
    "keywords": [
        "return",
        "income",
        "under",
        "notice",
        "assessment",
        "bombay",
        "court",
        "section",
        "assessee",
        "filed"
    ]
}