{
    "summary": "In resisting the workmen's claim for bonus for the year - the appellant contended that in calculating gross profits for the purpose of the Full Bench formula the following items of income should be excluded - (i) Income earned by way of rent, light and power (ii) estate revenue derived from sale of excess coconuts used in preparing oil grown in the appellant's groves (iii) profit from sale of empty barrels and (iv) sale proceeds of tin cans, scraps, Jogs, planks, gunnies etc. Shali- mar Rope Works Ltd., Shalimar, Howrah( ) by observ- ing at page  that \" it is however too late in the day to question tlie view that there are profits un- ~ related to workers' efforts and referred to as 'extraneous profits' and that such profits must be left out of account in deciding the question whether there is available surplus in any particular year.\" Income received by way of rent of quarters and by sale of scrap-materials has generally been treated as extra- neous income by the industrial tribunals on the basis of these decisions of the Labour Appellate Tribunal. It is this last condition which seems to have been relied upon by industrial • tribunals in holding that there must be direct ctmnec- tion hetween the efforts of labour and the profits, and unless that direct connection is established the profits must be treated as unrelated to the efforts of labour and thus become extraneous income. There is no doubt that there must be contribution of the workmen in earning profits before they are entitled to profit bonus but it wa.s not laid down in the Muir Mills Case(') that direct connection between the efforts of the workmen and the particular item of profit earned must be established before the profit can be taken into account for the purposes of arriving at the available ()  () S.C.R. . But apart from these cases, we cannot see how income arising during the year in the normal course of business of the concern can be called extraneous income merely on the ground that no direct connection between the efforts of labour and the accrual of the income has been established.",
    "keywords": [
        "income",
        "company",
        "profits",
        "labour",
        "workmen",
        "profit",
        "capital",
        "bonus",
        "tribunal",
        "these"
    ]
}