{
    "summary": "In supersession of Court‟s Circular Letter No. /Admin (B-) Section, Dated .., on the above subject, I am directed to say that in compliance of the judgment and order dated 5th July,  passed in Civil Appeal No.  of  (S.D. Bandi Vs. Divisional Traffic Officer, KSRTC & others), the Court has been pleased to frame the following guidelines, for retaining houses by Judicial officers- GUIDE LINES Norms for filing and processing of representations of Judicial Officers for retention of official residence after transfer/retirement/death ) The District Judges must ensure strict compliance of these Guidelines and any default must be immediately brought to the notice of the Court by Fax/Speed Post. Upon consideration of the said judgments and orders passed in the above mentioned Criminal appeals, the Hon‟ble Court has desired to make it imperative that, the trial court as well as the appellate court while deciding cases resulting in acquittal, must obtain bail bonds of the accused as well as of the sureties on prescribed proforma enclosed herewith for their appearance before the higher court as and when such court issues notice in respect of any appeal or petition filed against the judgment of the respective court in strict compliance of the provisions made in the section -A of Cr.P.C. Therefore, enclosing here with the copies of the judgments and orders passed in the above-mentioned criminal appeals and the modified proforma of form No.  (both English and Hindi version), I am to request you to kindly impress upon all the Judicial Officers under your administrative control to adhere to the directions mentioned therein in letter and spirit and use the aforesaid proforma in the light of the provisions in Section  of the Code of Criminal Procedure. I am, directed to inform you that Hon‟ble the Supreme Court, in the captioned matter, has framed following guidelines to be adopted in all cases where no-bailable warrants are issued by the Courts- The Guidelines (a) All the High Court shall ensure that the Subordinate Courts use printed and machine numbered Form No.  for issuing warrant of arrest and each such form is duly accounted for, (b) Before authenticating the Court must ensure that complete particulars of the case are mentioned on the warrant (c) The presiding Judge of the court (or responsible officer specially authorized for the purpose in case of High Court) issuing the warrant should put his full and legible signatures on the process, also ensuring that Court seal bearing complete particulars of the Court is prominently endorsed thereon (d) The court must ensure that warrant is directed to a particular police officer (of authority) and, unless intended to be open-ended, it must be returnable whether executed or unexecuted, on or before the date specified therein (e) Every Court must maintain a register (in the format given below), in which each warrant of arrest issued must be entered chronologically and the serial number of such entry reflected on the top right hand of the process (f) No warrant of arrest shall be issued without being entered in the register mentioned above and the concerned court shall periodically check/monitor the same to confirm that every such process is always returned to the court with due report and placed on the record of the concerned case (g) A register similar to the one in clause (e) supra shall be maintained at the concerned police station. The Station House Officer of the concerned Police Station shall ensure that each warrant of arrest issued by the Court, when received is duty entered in the said register and is formally entrusted to a  responsible officer for execution (h) Ordinarily, the Courts should not give a long time for return of execution of warrants, as experience has shown that warrants are prone to misuse if they remain in control of executing agencies for long (i) On the date fixed for the return of the warrant, the Court must insist upon a compliance report on the action taken thereon by the Station House Officer of the Concerned Police Station of the Officer-incharge of the concerned agency (j) The report on such warrants must be clear, cogent and legible and duly forwarded by a superior police officer, so as to facilitate fixing or responsibility in case of misuse (k) In the event of warrant for execution beyond jurisdiction of the Court issuing it, procedure laid down in Sections  and  of the Code must be strictly and scrupulously followed and (l) In the event of cancellation of the arrest warrant by the Court, the order cancelling warrant shall be recorded in the case file and the register maintained. Guidelines regarding constructions of Lawyers‘ Chambers, Court Building or the like from M.L.A./M.L.C./M.P. Fund C.L. No. /Infrastructure Cell Dated May ,  I have been directed to say that the Hon‟bel Court has been pleased to lay down following guidelines for all future constructions of Lawyers‟ Chambers, Court Building or the like from M.L.A./M.L.C./M.P. Fund over the land in premises of Civil Court- (I) Money under MLA/MLC/MP, Fund can be used for construction of Lawyers‟ Chambers subject to (a) In all matters detail information about the person giving the fund with the particulars of pending cases of any kind from his side or against him has to be furnished to this Court.",
    "keywords": [
        "court",
        "cases",
        "dated",
        "judicial",
        "under",
        "admin",
        "officers",
        "directed",
        "section",
        "officer"
    ]
}