{
    "summary": "Total  Note  – Biyani Securities Private Ltd  – Harish Biyani Page  of  From the above, it is noted that the buy as well as the sell orders were placed in lots of , shares for the entire quantity (except for lot of  shares on few occasions). In effect, Shri Harish Biyani used shares of DSQ Industries for availing finance in the ‘sell and cash’ scheme of SHCIL by selling shares as empanelled broker of SHCIL – i.e. Biyani Securities Pvt. financed by SHCIL on behalf of its clients Shri Harish Biyani under ‘sell-n-cash’ scheme through Biyani Securities Pvt Ltd and CSE, the counter party broker was Shri Harish Biyani himself.  No persons shall (a) effect, take part in, or enter into, either directly or indirectly, transactions in securities, with the intention of artificially raising or depressing the prices of securities and thereby inducing the sale or purchase of securities by any person (b) indulge in any act, which is calculated to create a false or misleading appearance of trading on the securities markets (c) indulge in any act, which results in reflection of prices of securities based on transactions that are not genuine trade transactions (d) enter into a purchase or sale of any securities, not intended to effect transfer of beneficial ownership but intended to operate only as a device to inflate, depress, or cause fluctuation in the market price of securities . Shri Harish Biyani and Biyani Securities Pvt Ltd acted in concert with the promoters of DSQ Group for creation of artificial market and rise in prices by entering into irregular transactions by way of synchronized trades and cross deals in which the order, quantity, time and prices are matched, financing of trades through the schemes of SHCIL, etc.",
    "keywords": [
        "10000",
        "biyani",
        "shares",
        "rathyatrasa",
        "securities",
        "harish",
        "hulda",
        "orders",
        "transactions",
        "market"
    ]
}