{
    "summary": "The entry reads tfius- \"Principles on which compensation for property acquired or requisitioned for purposes of the Union or of a State or for any other public purpose is to be determined, and the form and manner in which such compensation is to be given.\" This head of legislation seems to have been expressly mentioned in the Concurrent List not only in view of the accepted principle of law that in cases of compul- sory acquisition of property compensation has to be made but also in view of the clear and mandatory provisions of article () which require that a law authorising the taking or acquisition of propeny will be void if it does not provide for payment of compen- sation for the property acquired or does not either fix the amount of compensation or specify the principles on which and the manner in which the compensation is to be determined and given. We find that under article  Parliament has exclusive power to make laws with respect, inter ulia, to matters specified in entry  in List I, namely, \"acquisition or requisitioning of property for the pur- poses of the Union, that the State Legislatures have exclusive power to make laws with respect, inter alia, to matters specified in entry  in List II, namely, the \"acquisition or requisitioning of property except for the purposes of the Union subject to the provision of entry  of List III\" and that both Parliament and the State Legislatures may make laws with respect to matters set forth in entry  in List III, namely, the principles for determining the compensation and the form and manner of giving such compensation. This legislative power of Parliament or of the State Legis- latures is, by article , made \"subject to the provi- sions of this Constitution.\" One of the provilions 0f the Constitution is article  () under which no pro- perty can be \"taken possession of or acquired for public purposes under any law authorising the taking of such possession or such acquisition unless the law provides for compensation for the property and either fixes the amount of compensation or specifies the principles on which, and the mam1er in which, the compensation is to be determined and given.\" The scheme of our Constitution obviously is to provide the three things separately, namely, the power of making a law for acquisition of property in article  read with entry  in List I and entry  in List II, the obligation of such law to provide for compensation in article  () and the power of making a law laying down the · principles for determining such compen- sation in article  read with entry  in List III. If the require- ment of a public purpose were not a provision of article  (), then it will obviously lead us to the un- tenable conclusion that Parliament will be free under its residuary powers under article  and entry  of List I of the Seventh Schedule to make a law for ac- quiring private property without any public purpose at all and to the still more absurd result that while Parliament will have to provide for compensation under article  () in a law made by it for acquisitio• of property for a public purpose it will not have to make any provision for compensation in a law made for acquisition of property to be made without a public purpose. if it sees fit to do so, but it is not likely that it will be found disregarding it, without plain expres1sions of such a purpose.\" This principle is embodied in article  () of our Constitution in these terms - \"~o prop_erty, iiovable or immovaJle, including any mterest m, or m any company ownmg, any com- mercial or industrial undertaking, shall be taken pos- session of or acquired for public purposes under any law authorising the taking of such possession or such acquisition, unless the law provides for compensation for the property taken possession of or acquired and either fixes the amount of the compensation, or specifies the principles on which, and the manner in which, the compensation JS to be determined and given.\" We shall not here trouble ourselves with sub-clauses () and () of the article and with articles -A and -B which were introduced by way of amendment under the Constitution First Amendment Act, , dated --.",
    "keywords": [
        "state",
        "compensation",
        "entry",
        "article",
        "under",
        "public",
        "acquisition",
        "power",
        "purpose",
        "court"
    ]
}