{
    "summary": "Held, further, that if there was defect in the conduct of thC' Its Workn,.n enquiry by the employer it could be cured if all the relevant evidence including the witnesses who were not examined in the presence of the workman were produced before the Tribunal.  of the Act, which provided the qualifications of a tribunal, required that where it was one member tri- bunal, he (a) should be or should have been a Judge of a High Court, or (b) should be or should have been a district judge, or (c) should be qualified for appoint- ment as a Judge of a High Court.  - \" Stating it broadly and without intending it to be exhaustive, it mav be observed that rules of natu- ral justice require th.~t a party should have the oppor- tunity •>f a<ldueing all relevant evidence on which he relies, that the evidence of the opponent should bC' taken in his presence, and tha.t he should be given the opportunity of cros,examining the witnesses exa.min- ed by that party, and that no materials should be relied on agairnit him without his being given an opportunity of explaining them.\" It will he immediately clear that these principles were not followed in the enquiry which took place on March , inasmuch as the witnesses on which the company relied were not examined in the presence of Das.  of the Act for permission to dismiss an employee, he could make good the defect by producing all relevant evidence which would hare been examined at the enquiry, before the tribunal, in which case the tribunal would consider the evidence and decide whether per- mission should be granted or not. We should, howeYer, like to make it elear tlrnt the order of tlw Tribunal fixing grant of compcnsa,tion till the date of payment must be taken to be limited to the sum of Rs. ,, which has been deposited in this Court in pursuance of this Court's order of April ,  and Das will not be entitled t.o anything more, as further stay of payment was pursuant to the order of this Court.",
    "keywords": [
        "tribunal",
        "before",
        "enquiry",
        "court",
        "company",
        "evidence",
        "should",
        "march",
        "witnesses",
        "given"
    ]
}